import java.io.FileReader;
import java.io.FileWriter;
import java.io.IOException;
import java.io.RandomAccessFile;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.Scanner;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Task_code {
    //разобраться, как делать запись в файл + чтение, поиск, выдача поискового запроса
    /*
//    Парсинг файла по аргументам класса
    Сортировка файла
    Запись в файл в нужное место
    Удалить строку по найденному слову и вывести эту строку в консоль
//    Заполнение листа типа Human
    поиск по регулярному выражению
    чтобы поиск шел по определенному столбцу и весь этот столбец записывать в массив

    Валера  22  382-492 lawyer записать после брайана

    Метод, который делает запись в файл из строки и из массива
    Метод, который открывает файл, делает туда запись из консоли
    Получение информации из файла, вывод в консоль
    Построчное считывание файла, в строке несколько аргументов,
        разделенных табуляцией, разбить по строкам и по аргументам,
        в массив, класс, лист
    Поиск в файле нужного слова
    Аргументы: айди, имя, статус, дата
    поиск и вывод в консоль по любому из аргументов списка совпадений
    Сортировка данных файла по любому аргументу
    Запись в файл в нужное место
    Удалить строку по найденному слову и вывести эту строку в консоль
    Заполнение листа типа Human
    поиск по регулярному выражению
    чтобы поиск шел по определенному столбцу и весь этот столбец записывать в массив
     */
    public static void main(String[] args) {
        String fileName = "src/test.txt";
//        Scanner scanner = new Scanner(System.in);
//        String line = scanner.nextLine();
    }
}