public class Task_code {
    //разобраться, как делать запись в файл + чтение, поиск, выдача поискового запроса
    /*
    Метод, который делает запись в файл из строки и из массива
    Метод, который открывает файл, делает туда запись из консоли
    Получение информации из файла, вывод в консоль
    Построчное считывание файла, в строке несколько аргументов,
        разделенных табуляцией, разбить по строкам и по аргументам,
        в массив, класс, лист
    Поиск в файле нужного слова
    Аргументы: айди, имя, статус, дата
    поиск и вывод в консоль по любому из аргументов списка совпадений
    Сортировка данных файла по любому аргументу
    Запись в файл в нужное место
     */
}
